Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Inside the _producer_ project, create the `src/main/java/org/acme/pulsar/producer/QuotesResource.java` file and add the following content:
ja_jp: _プロデューサー_ プロジェクト内に、 `src/main/java/org/acme/pulsar/producer/QuotesResource.java` ファイルを作成し、次のコンテンツを追加します。

source: Inside the _producer_ project, create the `src/main/resources/META-INF/resources/quotes.html` file with the following content:
ja_jp: _プロデューサー_ プロジェクト内に、次の内容で `src/main/resources/META-INF/resources/quotes.html` ファイルを作成します。

source: Inside the _pulsar-quickstart-producer_ project, create the `src/main/resources/META-INF/resources/quotes.html` file with the following content:
ja_jp: _pulsar-quickstart-producer_ プロジェクト内に、次の内容の `src/main/resources/META-INF/resources/quotes.html` ファイルを作成します。

source: Inside the `producer` project locate the generated `src/main/java/org/acme/amqp/producer/QuotesResource.java` file, and update the content to be:
ja_jp: `producer` プロジェクト内で、生成された `src/main/java/org/acme/amqp/producer/QuotesResource.java` ファイルを見つけ、コンテンツを次のように更新します。

source: Inside the `producer` project locate the generated `src/main/java/org/acme/rabbitmq/producer/QuotesResource.java` file, and update the content to be:
ja_jp: `producer` プロジェクト内で、生成された `src/main/java/org/acme/rabbitmq/producer/QuotesResource.java` ファイルを探し、コンテンツを次のように更新します:

source: Inside the `producer` project, locate the generated `src/main/java/org/acme/amqp/producer/QuotesResource.java` file, and update the content to be:
ja_jp: `producer` プロジェクト内で、生成された `src/main/java/org/acme/amqp/producer/QuotesResource.java` ファイルを見つけ、コンテンツを次のように更新します。

source: Insight into available extensions and their capabilities
ja_jp: 利用可能なエクステンションとその機能に関するインサイト

source: Inspect a memory dump from the application.
ja_jp: アプリケーションからのメモリーダンプを検査する。

source: Inspect and/or reject HTTP upgrade
ja_jp: HTTP アップグレードを検査および/または拒否する

source: Inspect metadata to determine if a fruit has been actually deleted.
ja_jp: メタデータを調べて、fruit が実際に削除されたかどうかを判断します。

source: Inspect the call paths that get included into a Quarkus Native app with Neo4j
ja_jp: Neo4jでQuarkus Nativeアプリに含まれるコールパスを検査する

source: Inspecting Generated/Transformed Classes in `QuarkusUnitTest`
ja_jp: `QuarkusUnitTest` で生成/変換されたクラスを検査する

source: Inspecting Native Executables
ja_jp: ネイティブ実行可能ファイルの検査

source: Inspecting and Debugging Native Executables
ja_jp: ネイティブ実行可能ファイルの検査とデバッグ

source: Inspecting the Generated/Transformed Classes
ja_jp: 生成・変換されたクラスの検査

source: Inspecting the Quarkus Native call path universe with Neo4j
ja_jp: Neo4jでQuarkus Nativeのコールパスユニバースを検査する

source: Inspecting the list of consumer groups and their consumption lag
ja_jp: コンシューマーグループの一覧とその消費ラグの閲覧

source: Install GraalVM if you haven't already. You have a few options for this:
ja_jp: まだの場合は、GraalVM をインストールします。これにはいくつかのオプションがあります:

source: Install `m2e-apt` from https://marketplace.eclipse.org/content/m2e-apt
ja_jp: https://marketplace.eclipse.org/content/m2e-apt から `m2e-apt` をインストール

source: Install modelling plugins in your IDE
ja_jp: モデリングプラグインをIDEにインストールする

source: Install the Azure CLI
ja_jp: Azure CLIのインストール

source: Install the Heroku CLI
ja_jp: Heroku CLI のインストール

source: Install the Maven dependencies
ja_jp: Maven の依存関係をインストールします。

source: Install via Command Line Interface
ja_jp: コマンドラインインターフェースを介したインストール

source: Installation
ja_jp: インストール

source: Installing
ja_jp: インストール

source: Installing AWS bits
ja_jp: AWS ビットのインストール

source: Installing Podman
ja_jp: Podman のインストール

source: Installing all the AWS bits is probably the most difficult thing about this guide. Make sure that you follow all the steps for installing AWS CLI.
ja_jp: AWSのすべてのツールをインストールすることは、おそらくこのガイドでは最も難しいことです。AWS CLIをインストールするためのすべての手順に従っていることを確認してください。

source: Installing all the AWS bits is probably the most difficult thing about this guide. Make sure that you follow all the steps for installing AWS SAM CLI.
ja_jp: AWSのすべてのツールをインストールすることは、おそらくこのガイドでは最も難しいことです。AWS CLIをインストールするためのすべての手順に従っていることを確認してください。

source: Installing the CLI
ja_jp: CLI のインストール

source: Installing via scoop will do this for you.
ja_jp: scoop でインストールすれば自動的に設定されます。

source: Instance Produced Through Recorder
ja_jp: レコーダーを通して生成されたインスタンス

source: Instance profile credentials delivered through the Amazon EC2 metadata service
ja_jp: Amazon EC2メタデータサービスを通じて配信されるインスタンスプロファイルの資格情報

source: Instances of decorators are dependent objects of the bean instance they intercept, i.e. a new decorator instance is created for each intercepted bean.
ja_jp: デコレーターのインスタンスは、インターセプトするBeanのインスタンスに依存するオブジェクトです。つまり、インターセプトされたBeanごとに新しいデコレーターインスタンスが作成されます。

source: Instances of interceptors are dependent objects of the bean instance they intercept, i.e. a new interceptor instance is created for each intercepted bean.
ja_jp: インターセプタのインスタンスは、インターセプトするBeanのインスタンスに依存するオブジェクトです。

source: Instant hot code replacement: don't allow build, deploy, boot delays disrupt your flow
ja_jp: インスタントなホットコードの置き換え: ビルド、デプロイ、ブートの遅延がフローを混乱させないようにします

source: Instantiate the record and use it as an ordinary `TemplateInstance`.
ja_jp: レコードをインスタンス化し、通常の `TemplateInstance` として使用します。

source: Instead of `@Named`, use `@io.smallrye.common.annotation.Identifier`. This is a regular qualifier that works like all others. So if we rewrite the example to use `@Identifier`:
ja_jp: `@Named` の代わりに、`@io.smallrye.common.annotation.Identifier` を使用してください。これは他のすべての修飾子と同様に機能する通常の修飾子です。したがって、例を `@Identifier` を使用するように書き換えると次のようになります。

source: Instead of `QUARKUS_KAFKA_STREAMS_BOOTSTRAP_SERVERS`, you can use `KAFKA_BOOTSTRAP_SERVERS`.
ja_jp: `QUARKUS_KAFKA_STREAMS_BOOTSTRAP_SERVERS` の代わりに、 `KAFKA_BOOTSTRAP_SERVERS` を使うこともできます。

source: Instead of ``quarkus-vertx-core`, use `quarkus-vertx-http`:
ja_jp: ``quarkus-vertx-core` の代わりに、 `quarkus-vertx-http` を使用してください:

source: Instead of `transformToMultiAndConcatenate` you can use `transformToMultiAndMerge` if you don't care about the order of the items.
ja_jp: アイテムの順番を気にしないのであれば、 `transformToMultiAndConcatenate` の代わりに `transformToMultiAndMerge` を使うこともできます。

source: Instead of annotating the client with `@RegisterRestClient`, and injecting a client with `@RestClient`, you can also create REST Client programmatically. You do that with `RestClientBuilder`.
ja_jp: クライアントに `@RegisterRestClient` アノテーションを付け、クライアントに `@RestClient` を挿入する代わりに、プログラムで REST クライアントを作成することもできます。これは `RestClientBuilder` で行います。

source: Instead of annotating the client with `@RegisterRestClient`, and injecting a client with `@RestClient`, you can also create REST Client programmatically. You do that with the `QuarkusRestClientBuilder`.
ja_jp: クライアントに `@RegisterRestClient` アノテーションを付け、クライアントを `@RestClient` で注入する代わりに、 プログラムで REST Client を作成することもできます。 これは `RestClientBuilder` で行います。

source: Instead of annotating your test with `@Transactional` (which will persist the changes), annotate your test with `@TestTransaction` and the changes will be automatically rolled back at the end of the test.
ja_jp: テストを (変更を持続させる) `@Transactional` でアノテーションするのではなく、テストを `@TestTransaction` でアノテーションすると、テストの最後に変更が自動的にロールバックされます。

source: Instead of declaring a `Logger` field, you can use the simplified logging API:
ja_jp: `Logger` フィールドを宣言する代わりに、簡略化されたロギング API を使用することができます。

source: Instead of declaring a logger field, you can use an alternative approach and inject a configured `org.jboss.logging.Logger` instance by using `@Inject`. This approach applies only to CDI beans.
ja_jp: ロガーフィールドを宣言する代わりに、別の方法として `@Inject` を使用して設定済みの `org.jboss.logging.Logger` インスタンスを注入できます。この方法は CDI Bean にのみ適用されます。

source: Instead of defining credentials directly in configuration, you can integrate with a Quarkus Credentials Provider. This allows credentials to be retrieved securely from external systems. Examples include vaults or secret managers.
ja_jp: 設定でクレデンシャルを直接定義する代わりに、Quarkus クレデンシャルプロバイダーと統合できます。これにより、クレデンシャルを外部システム (Vault やシークレットマネージャーなど) から安全に取得できます。

source: Instead of direct construction, use the new builder API. Choose `owned()` for services which are to be created, or `discovered()` to register externally-managed services which have been discovered.
ja_jp: 直接構築する代わりに、新しいビルダー API を使用してください。作成されるサービスには `owned()` を、検出された外部管理サービスを登録するには `discovered()` を選択します。

source: Instead of directly constructing a `DevServicesResultBuildItem`, switch to use the `discovered()` and `owned()` link:#the-builder[builders] on `DevServicesResultBuildItem`
ja_jp: `DevServicesResultBuildItem` を直接構築する代わりに、 `DevServicesResultBuildItem` 上の `discovered()` および `owned()` link:#the-builder[ビルダー] を使用するように切り替えます。

source: Instead of doing a normal podman push (OCI format) we must use a workaround in order to push and release our app through Podman and the Heroku CLI in the desired format (v2s2 - Docker Image Manifest Version 2, Schema 2). Also https://github.com/containers/skopeo[skopeo] is needed.
ja_jp: 通常の podman push (OCI 形式) を実行する代わりに、回避策を使用して、Podman と Heroku CLI を介してアプリケーションを目的の形式 (v2s2 - Docker Image Manifest Version 2、Schema 2) でプッシュおよびリリースする必要があります。また、https://github.com/containers/skopeo[skopeo] も必要です。

source: Instead of dynamically creating OpenAPI schemas from annotation scanning, Quarkus also supports serving static OpenAPI documents. The static file to serve must be a valid document conforming to the https://swagger.io/docs/specification[OpenAPI specification]. An OpenAPI document that conforms to the OpenAPI Specification is itself a valid JSON object, that can be represented in `yaml` or `json` formats.
ja_jp: Quarkusでは、アノテーションスキャンからOpenAPIスキーマを動的に作成する代わりに、静的なOpenAPIドキュメントの配信もサポートしています。サーブする静的ファイルは、 link:https://swagger.io/docs/specification[OpenAPI仕様] に準拠した有効なドキュメントである必要があります。OpenAPI仕様に準拠したOpenAPIドキュメントは、それ自体が有効なJSONオブジェクトであり、 `yaml` または `json` 形式で表現できます。

source: Instead of explicitly enforcing access based on some specific access control mechanism such as Role-Based Access Control(RBAC), `quarkus-keycloak-authorization` checks whether a request is allowed to access a resource based on its name, identifier or URI by sending a bearer access token verified by `quarkus-oidc` to Keycloak Authorization Services where an authorization decision is made.
ja_jp: RBAC（Role-Based Access Control）のような特定のアクセス制御メカニズムに基づいて明示的にアクセス強制する代わりに、 `quarkus-keycloak-authorization` は、認可判断をするKeycloak Authorization Servicesに `quarkus-oidc` で検証されたベアラアクセストークンを送信してリクエストの名前、識別子、URIに基づいてリソースへのアクセスが許可されているかどうかをチェックします。

source: Instead of importing `io.quarkus:quarkus-rest`, you can import either of the following modules to get support for JSON:
ja_jp: `io.quarkus:quarkus-rest` をインポートする代わりに、以下のモジュールのいずれかをインポートして、JSON のサポートを受けることができます。

source: Instead of importing `io.quarkus:quarkus-resteasy-reactive`, you can import either of the following modules to get support for JSON:
ja_jp: `io.quarkus:quarkus-resteasy-reactive` をインポートする代わりに、以下のモジュールのいずれかをインポートすることで、JSON のサポートを受けることができます。

source: Instead of overriding the value, we just want to ensure that the greet method on our `GreetingService` was called by this test.
ja_jp: 値をオーバーライドするのではなく、 `GreetingService` の greet メソッドがこのテストで呼び出されたことを確認したいだけです。

source: Instead of passing the truststore password in the configuration, you can use a credential provider. A credential provider allows you to retrieve passwords and other credentials. Note that the credential provider is used only if the password is not set in the configuration.
ja_jp: 設定でトラストストアのパスワードを渡す代わりに、認証情報プロバイダーを使用できます。 認証情報プロバイダーを使用すると、パスワードやその他の認証情報を取得できます。 認証情報プロバイダーは、設定でパスワードが指定されていない場合にのみ使用されることに注意してください。

source: Instead of returning a payload, you can return a `io.smallrye.reactive.messaging.kafka.Record` to send key/value pairs:
ja_jp: ペイロードを返す代わりに、 `io.smallrye.reactive.messaging.kafka.Record` を返して、キーと値のペアを送信できます。

source: Instead of returning a payload, you can return a `io.smallrye.reactive.messaging.pulsar.OutgoingMessage` to send Pulsar messages:
ja_jp: ペイロードを返す代わりに、 `io.smallrye.reactive.messaging.pulsar.OutgoingMessage` を返して、Pulsar メッセージを送信することもできます。

source: Instead of running them directly on the host machine using the Quarkus dev mode, we're going to package them into container images and launch them via Docker Compose. This is done in order to demonstrate scaling the `aggregator` aggregation to multiple nodes later on.
ja_jp: Quarkusのdevモードを使ってホストマシン上で直接実行するのではなく、コンテナーイメージにパッケージ化してDocker Compose経由で起動します。これは、後で `aggregator` のアグリゲーションを複数のノードにスケーリングすることを実証するために行います。

source: Instead of sending a client secret, Quarkus OIDC can authenticate to OIDC providers by sending a generated JWT authentication token signed with either a client secret or private key.
ja_jp: クライアントシークレットを送信する代わりに、 Quarkus OIDC は、クライアントシークレットまたは秘密鍵のいずれかで署名された生成済みの JWT 認証トークンを送信することによって、 OIDC プロバイダーに対して認証を行うことができます。

source: Instead of the default configuration, you can use a named configuration:
ja_jp: デフォルト設定の代わりに、名前付き設定を使用できます。

source: Instead of using an existing method to close the LRA you might prefer to write one which expects there to be a context. In this case you would want to set the `LRA.Type` element:
ja_jp: LRAを閉じるために既存のメソッドを使うのではなく、コンテキストがあることを前提としたメソッドを書きたいと思うかもしれません。この場合、 `LRA.Type` 要素を設定することになります。

source: Instead of using only the `quarkus-vertx-core` extension, we can choose to delegate the HTTP server to Quarkus. You may see that as a loss of control, but actually, we rarely do much around it, and again, you can configure it from the `application.properties` file if needed.
ja_jp: `quarkus-vertx-core` のエクステンションだけを使用するのではなく、HTTPサーバーをQuarkusに委任することもできます。 これは制御できないと思われるかもしれませんが、実際には、そのようなことは滅多にしませんが、必要なら、 `application.properties` ファイルから設定することが可能です。

source: Instead, Quarkus has its own API: `InterceptionProxy` and `@BindingsSource`. The `InterceptionProxy` is very similar to `InterceptionFactory`: it creates a proxy that applies `@AroundInvoke` interceptors before forwarding the method call to the target instance. The `@BindingsSource` annotation allows setting interceptor bindings in case the intercepted class is external and cannot be changed.
ja_jp: 代わりに、Quarkus には独自の API: `InterceptionProxy` と `@BindingsSource` があります。 `InterceptionProxy` は `InterceptionFactory` と非常によく似ており、メソッド呼び出しをターゲットインスタンスに転送する前に `@AroundInvoke` インターセプターを適用するプロキシーを作成します。 `@BindingsSource` アノテーションを使用すると、インターセプトされたクラスが外部にあり、変更できない場合に、インターセプターバインディングを設定できます。

source: Instead, create a `src/main/java/org/acme/optaplanner/solver/TimeTableConstraintProvider.java` class to perform incremental score calculation. It uses OptaPlanner's ConstraintStream API which is inspired by Java Streams and SQL:
ja_jp: 代わりに、 `src/main/java/org/acme/optaplanner/solutioner/TimeTableConstraintProvider.java` クラスを作成して、増分スコア計算を実行します。これは、JavaStreams と SQL に触発された OptaPlanner の ConstraintStreamAPI を使用します。

source: Instead, you can request that the user be redirected to a public, application-specific session-expired page first. This page informs the user that the session has now expired and advises re-authenticating by following a link to a secured application welcome page.
ja_jp: 代わりに、まずユーザーをパブリックのアプリケーション固有のセッション期限切れページにリダイレクトするようにリクエストできます。 このページで、セッションの有効期限が切れたことをユーザーに通知し、保護されたアプリケーションのウェルカムページへのリンクをたどって再認証するように指示します。

source: Instead, you can request that the user is redirected to a public, application specific session expired page first. This page informs the user that the session has now expired and advise to re-authenticate by following a link to a secured application welcome page. The user clicks on the link and Quarkus OIDC enforces a redirect to the OIDC provider to re-authenticate. Use `quarkus.oidc.authentication.session-expired-page` relative path property, if you'd like to do it.
ja_jp: 代わりに、まずユーザーをパブリックのアプリケーション固有のセッション期限切れページにリダイレクトするようにリクエストできます。このページで、セッションの有効期限が切れたことをユーザーに通知し、保護されたアプリケーションのウェルカムページへのリンクをたどって再認証するように指示します。ユーザーがリンクをクリックすると、Quarkus OIDC が再認証のために OIDC プロバイダーへのリダイレクトを適用します。必要に応じて、 `quarkus.oidc.authentication.session-expired-page` 相対パスプロパティーを使用します。

source: Instruct Panache to run the given (asynchronous) action in a transaction. The transaction completes when the action completes.
ja_jp: トランザクションで指定された (非同期の) アクションを実行するように Panache に指示します。アクションが完了すると、トランザクションが完了します。

source: Instruct Reactive Messaging to dispatch the items from the returned `Multi` (static list of weather stations) to `weather-stations`.
ja_jp: 返された `Multi` (気象観測所の静的リスト) から `weather-stations` にアイテムを発送するように、Reactive Messaging に指示します。

source: Instruct Reactive Messaging to dispatch the items from the returned `Multi` to `temperature-values`.
ja_jp: 返却された `Multi` から `temperature-values` にアイテムを発送するように Reactive Messaging に指示します。

source: Instruct a Quarkus application to generate call tree CSV files.
ja_jp: コールツリーのCSVファイルを生成するようにQuarkusアプリケーションに指示

source: Instruct the JaCoCo plugin to instrument the `io.quarkus:quarkus-runtime-module-name` artifact.
ja_jp: JaCoCo プラグインに対し、`io.quarkus:quarkus-runtime-module-name` アーティファクトをインストルメントするように指示します。

source: Instruct the JaCoCo plugin to instrument the `io.quarkus:quarkus-runtime-module-name`` artifact.
ja_jp: `io.quarkus:quarkus-runtime-module-name` アーティファクトをインストゥルメントするように JaCoCo プラグインに指示します。

source: Instructions on how to use Grafana Otel LGTM
ja_jp: Grafana Otel LGTMの使い方

source: Instructs Quarkus not to fail if a mismatch is detected.
ja_jp: 不一致が検出された場合にQuarkusが失敗しないように指示します。

source: Instructs Quarkus to invoke this method on a virtual thread
ja_jp: 仮想スレッド上でこのメソッドを呼び出すようQuarkusに指示します。

source: Instructs the prices channel to be managed by the AMQP connector
ja_jp: 価格チャネルに AMQP コネクターで管理するように指示します

source: Instructs the prices channel to be managed by the RabbitMQ connector
ja_jp: 価格チャネルに RabbitMQ コネクターでの管理を指示

source: Instrument `org.acme:bar` when running tests in `bar/deployment`.
ja_jp: `bar/deployment` でテストを実行する際に `org.acme:bar` をインストゥルメントします。

source: Instrument `org.acme:foo` when running tests in `bar/deployment`.
ja_jp: `bar/deployment` でテストを実行する際に `org.acme:foo` をインストゥルメントします。

source: Instrumentation scope is allways `io.quarkus.opentelemetry`
ja_jp: 計装スコープは常に `io.quarkus.opentelemetry` です。

source: Instrumentation scope is always `io.quarkus.opentelemetry`
ja_jp: インストルメンテーションのスコープは常に `io.quarkus.opentelemetry` です

source: Instrumentation-based live reload disabled by default
ja_jp: インスツルメンテーションベースのライブリロードがデフォルトで無効化

source: Integer Numbers
ja_jp: 整数値

source: Integrate Quarkus with the Microsoft Azure functions that you have written.
ja_jp: 作成したMicrosoft Azure functionsとQuarkusの統合。

source: Integrate RAG to anchor Large Language Model (LLM) responses in your enterprise data, with Quarkus handling ingestion pipelines, query execution, embedding generation, context retrieval, and seamless LLM interaction. This blueprint focuses on the foundational RAG pattern (also called frozen RAG); more advanced contextual RAG variants, including multi-source routing and reranking, are covered separately.
ja_jp: RAGを統合して、大規模言語モデル (LLM) の応答を企業データに固定します。Quarkusは、取り込みパイプライン、クエリ実行、埋め込み生成、コンテキスト取得、シームレスなLLM連携を処理します。このブループリントは、基本的なRAGパターン（Frozen RAGとも呼ばれる）に焦点を当てています。マルチソースルーティングや再ランキングを含む、より高度なコンテキストRAGのバリアントについては別途説明します。

source: Integrating the traditional Drools programming model with Quarkus
ja_jp: 従来の Drools プログラミングモデルと Quarkus の統合

source: Integrating very tightly with Eclipse Vert.x for everything IO related. Vert.x has been extremely well optimized for IO operations and so tight integration with it allows RESTEasy Reactive to benefit from all that work. You might recall that RESTEasy Classic on Quarkus uses Vert.x under the hood as well, but in that case the integration is not as deep and is therefore unable to fully utilize the power of Vert.x.
ja_jp: IO に関連するすべてを Eclipse Vert.x と緊密に統合します。Vert.x は IO 操作のために非常によく最適化されています。そのため、RESTEasy Reactive はそれとの緊密な統合により、その恩恵を受けることができます。RESTEasy Classic on Quarkus も同様に Vert.x を使用しています。ただし、その場合、統合はそれほど深くないため、Vert.x のパワーを十分に活用することができません。

source: Integrating with Development Mode
ja_jp: 開発モードとの連携

source: Integrating with Hibernate ORM
ja_jp: Hibernate ORMとの連携

source: Integrating with Hibernate Reactive
ja_jp: Hibernate Reactiveとの統合

source: Integrating with Kafka
ja_jp: Kafkaとの連携

source: Integrating with Kafka - Common patterns
ja_jp: Kafka との統合 - 一般的なパターン

source: Integrating with `systemd-notify`
ja_jp: `systemd-notify` との統合

source: Integration
ja_jp: 統合

source: Integration Between Java and Qute Template Files
ja_jp: JavaとQuteのテンプレートファイル間の統合

source: Integration Testing
ja_jp: 統合テスト

source: Integration Testing with the Tracing Agent
ja_jp: トレースエージェントを使用した結合テスト

source: Integration between Qute templates and Java
ja_jp: QuteテンプレートとJavaの連携

source: Integration considerations
ja_jp: インテグレーションに関する考慮事項

source: Integration is automatic if the Narayana JTA extension is also available.
ja_jp: Narayana JTAエクステンションも利用可能であれば、統合は自動的に行われます。

source: Integration test
ja_jp: 統合テスト

source: Integration testing
ja_jp: 統合テスト

source: Integration tests (i.e. tests that are annotated with `@QuarkusIntegrationTest`) run against the application with AOT training enabled
ja_jp: AOT トレーニングが有効な状態で、アプリケーションに対して統合テスト (つまり `@QuarkusIntegrationTest` アノテーションが付いたテスト) が実行される

source: Integration tests run against the application, exercising its endpoints and features.
ja_jp: 統合テストがアプリケーションに対して実行され、そのエンドポイントと機能を検証します。

source: Integration tests that use `@QuarkusIntegrationTest` make it very easy to run the target application as they use Dev Services.
ja_jp: `@QuarkusIntegrationTest` を使用する統合テストは、Dev Services を利用するため、ターゲットアプリケーションの実行を非常に簡単にします。

source: Integration with Bean Validation
ja_jp: Bean Validation との統合

source: Integration with GitHub and non-OIDC OAuth2 providers
ja_jp: GitHub および OIDC 以外の OAuth2 プロバイダーとのインテグレーション

source: Integration with GitHub and other OAuth2 providers
ja_jp: GitHub およびその他の OAuth2 プロバイダーとの統合

source: Integration with GraphQL UI works similarly; the access token acquired by Dev UI for Keycloak is used.
ja_jp: `GraphQL UI` とのインテグレーションも同様に機能し、Keycloak 用の Dev UI によって取得されたアクセストークンが使用されます。

source: Integration with `GraphQL UI` works in a similar way, the access token acquired by Dev UI for Keycloak will be used.
ja_jp: `GraphQL UI` との統合も同様に機能し、Keycloak 用に Dev UI によって取得されたアクセストークンが使用されます。

source: Integration with https://kogito.kie.org/[Kogito^]
ja_jp: Integration with https://kogito.kie.org/[Kogito^] との連携

source: Integration with the Envers extension is not supported.
ja_jp: Enversエクステンションとの統合はサポートされていません。

source: Integration with the build system
ja_jp: ビルドシステムとの統合

source: Integrations and support for cloud services
ja_jp: クラウドサービスとの統合・サポート

source: Integrations with messaging systems like Kafka, AMQP, or RabbitMQ.
ja_jp: Kafka、AMQP、RabbitMQのようなメッセージングシステムとの統合。

source: IntelliJ IDEA JUnit template
ja_jp: IntelliJ IDEA JUnit テンプレート

source: IntelliJ IDEA plugin that works in IntelliJ IDEA Community and Ultimate. Available from Marketplace.
ja_jp: IntelliJ IDEA CommunityとUltimateで動作するIntelliJ IDEA プラグイン。マーケットプレイスから入手可能

source: IntelliJ JUnit template
ja_jp: IntelliJ JUnit テンプレート

source: IntelliJ plugin that works in IntelliJ Community and Ultimate. Available from Marketplace.
ja_jp: IntelliJ CommunityとUltimateで動作するIntelliJプラグイン。マーケットプレイスから入手可能

source: Intelligent Execution Mode Selection
ja_jp: 実行モードのインテリジェントな選択

source: Inter-document anchored ID call example
ja_jp: 文書間のアンカー ID 呼び出しの例

source: Interact with Kubernetes and develop Kubernetes Operators
ja_jp: Kubernetes と対話し、Kubernetes オペレーターを開発する

source: Interact with predictive and generative AI models (in-process, locally or remotely).
ja_jp: 予測型AIモデルや生成型AIモデルと連携する（インプロセス、ローカル、またはリモートで）。

source: Interacting With Extension Beans
ja_jp: エクステンション Bean とのインタラクション

source: Interacting with Dev UI
ja_jp: 開発 UI の操作
